Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateBentPlateByParts(System.Int32,System.Int32)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateBentPlateByPartsAndRadius(System.Int32,System.Int32,System.Double)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateBentPlateByFaces(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateBentPlateByFacesAndRadius(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@,System.Double)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportConnectGeometryTrees(Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportConnectGeometryTreesWithRadius(System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportConnectGeometryTreesByPoints(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportConnectGeometryTreesByPointsWithRadius(System.Double,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyGeometryTreeCylindricalNodeRadius(System.Int32,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyGeometryTreeCylindricalNodeCurveType(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyGeometryTreePolygonNode(System.Int32,Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyCylindricalSurfaceNode(System.Int32,Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExplodeBentPlate(System.Int32)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportExtractBentPlateFromComponent(System.Int32)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetBentPlateMinimumRadius(System.Int32)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetBentPlateMaximumRadius(System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectBentPlate(Tekla.Structures.ModelInternal.dotPart_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyBentPlate(Tekla.Structures.ModelInternal.dotPart_t@)
DO NOT USE! For internal usage only!
pPart: The bent plate to modify
Returns: 0 in the case of failure and 1 in the case of success

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSingleRebarGetRebarSet(System.Int32)
DO NOT USE! For internal usage only!
singleRebarId: The single rebar ID.
Returns: The parent rebar set ID.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportAddToPourUnit(Tekla.Structures.ModelInternal.dotPourObject_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
inputPour:
clientId:
Returns: